app/controllers/recipes_controller.rb

SELECT * FROM "recipes"
---
  def index
    @recipes = Recipe.all

INSERT INTO "recipes" ("created_at", "title", "method", "updated_at", "user_id") VALUES('2011-02-14 13:49:43', 'Boiled Egg and Soldiers', 'Boil Water, add egg and boil, toast bread and then butter, slice bread!', '2011-02-14 13:49:43', NULL)
---
def create
  @recipe = Recipe.new(params[:recipe])
  if @recipe.save

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
---
  def edit
	  @recipe= Recipe.find(params[:id])

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
UPDATE "recipes" SET "updated_at" = '2011-02-07 11:17:46', "method" = 'Toast the bread, slice the cheese, then place the cheese on the toast and melt! Lovely Jubbly!' WHERE "id" = 4
---
  def update
    @recipe= Recipe.find(params[:id])
    if @recipe.update_attributes(params[:recipe])

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
---
  def show
	  @recipe= Recipe.find(params[:id])

SELECT * FROM "recipes" WHERE ("recipes"."id" = 3)
DELETE FROM "recipes" WHERE "id" = 3
---
  def destroy
    @recipe= Recipe.find(params[:id])
    @recipe.destroy